local VIPDetailData={}

-- VIP特权描述
function VIPDetailData:GetVipDescTable()
    local cfg={
        { id = 1 , desc = {
        "",
        "",
        "",
        "888",
        "显示专属荣耀身份",
        } },
        { id = 2, desc = {
            "5%",  --排位分加成
            "5%", --排位分加成
            "",  --签到送豆
            "888", --救济金送豆
            "显示专属荣耀身份",
        } },
        { id = 3, desc = {
            "5%",  --排位分加成
            "5%", --排位分加成
            "1.5",  --签到送豆
            "2000", --救济金送豆
            "显示专属荣耀身份",
        } },
        { id = 4, desc = {
            "10%",  --排位分加成
            "10%", --排位分加成
            "1.5",  --签到送豆
            "3000", --救济金送豆
            "显示专属荣耀身份",
        } },
        { id = 5, desc = {
            "10%",  --排位分加成
            "10%", --排位分加成
            "1.5",  --签到送豆
            "4000", --救济金送豆
            "显示专属荣耀身份",
        } },
        { id = 6, desc = {
            "15%",  --排位分加成
            "15%", --排位分加成
            "1.5",  --签到送豆
            "5000", --救济金送豆
            "显示专属荣耀身份",
        } },
        { id = 7, desc = {
            "15%",  --排位分加成
            "15%", --排位分加成
            "2",  --签到送豆
            "8000", --救济金送豆
            "显示专属荣耀身份",
        } },
        { id = 8, desc = {
            "20%",  --排位分加成
            "20%", --排位分加成
            "2",  --签到送豆
            "1万", --救济金送豆
            "显示专属荣耀身份",
        } },
        { id = 9, desc = {
            "20%",  --排位分加成
            "20%", --排位分加成
            "2",  --签到送豆
            "1.5万", --救济金送豆
            "显示专属荣耀身份",
        } },
        { id = 10, desc = {
            "20%",  --排位分加成
            "20%", --排位分加成
            "2",  --签到送豆
            "2万", --救济金送豆
            "显示专属荣耀身份",
        } },
        { id = 11, desc = {
            "20%",  --排位分加成
            "20%", --排位分加成
            "2.5",  --签到送豆
            "3万", --救济金送豆
            "显示专属荣耀身份",
        } },
        { id = 12, desc = {
            "20%",  --排位分加成
            "20%", --排位分加成
            "2.5",  --签到送豆
            "4万", --救济金送豆
            "显示专属荣耀身份",
        } },
        { id = 13, desc = {
            "20%",  --排位分加成
            "20%", --排位分加成
            "2.5",  --签到送豆
            "5万", --救济金送豆
            "显示专属荣耀身份",
        } },
        { id = 14, desc = {
            "20%",  --排位分加成
            "20%", --排位分加成
            "3",  --签到送豆
            "6万", --救济金送豆
            "显示专属荣耀身份",
        } },
        { id = 15, desc = {
            "20%",  --排位分加成
            "20%", --排位分加成
            "3",  --签到送豆
            "7万", --救济金送豆
            "显示专属荣耀身份",
        } },
        { id = 16, desc = {
            "20%",  --排位分加成
            "20%", --排位分加成
            "3",  --签到送豆
            "8万", --救济金送豆
            "显示专属荣耀身份",
        } },

    }
    return cfg
end

return VIPDetailData
